#!/usr/bin/env python3
from copy import copy
import z3


CHRS = "ᚠᚢᚦᚩᚱᚳᚷᚹ"
SIZE = 0x10000
PTR_MASK = SIZE - 1
VTABLE = SIZE - (len(CHRS) + 2)
FLAG = [b for b in b'midnight{'] + [z3.BitVec(f"flag{i}", 8) for i in range(21)] + [b for b in b'}\n']
# FLAG = [b for b in b'1234567890123456789012345678901\n']
assert len(FLAG) == 32


def is_true(expr):
    if isinstance(expr, bool):
        return expr
    return z3.is_true(expr)


def is_false(expr):
    if isinstance(expr, bool):
        return not expr
    return z3.is_false(expr)


def is_sat(expr):
    solver = z3.Solver()
    solver.add(expr)
    return str(solver.check()) == "sat"


class State:
    NEXT_ID = 0

    def __init__(self, code):
        self.code = code
        self.mem = [0] * SIZE
        self.mem[VTABLE : (VTABLE + len(CHRS) - 2)] = list(range(len(CHRS) + 1))[:8]
        self.ptr = 0
        self.pc = 0
        self.brackets = []
        self.flag_len = 0
        self.flag_eq = bytearray(8 * len(FLAG))
        self.flag_neq = bytearray(8 * len(FLAG))
        self.id = State.NEXT_ID
        State.NEXT_ID += 1

    def __copy__(self):
        state = State(self.code)
        state.mem = list(self.mem)
        state.ptr = self.ptr
        state.pc = self.pc
        state.brackets = list(self.brackets)
        state.flag_len = self.flag_len
        state.flag_eq = bytearray(self.flag_eq)
        state.flag_neq = bytearray(self.flag_neq)
        return state

    def step(self):
        next_states = []
        op = self.get_op()
        if op == 0:
            self.ptr = (self.ptr + 1) & PTR_MASK
            self.pc += 1
            next_states.append(self)
        elif op == 1:
            self.ptr = (self.ptr - 1) & PTR_MASK
            self.pc += 1
            next_states.append(self)
        elif op == 2:
            val = (self.mem[self.ptr] + 1) & 0xff
            if not isinstance(val, int):
                val = z3.simplify(val)
            self.mem[self.ptr] = val
            self.pc += 1
            next_states.append(self)
        elif op == 3:
            val = (self.mem[self.ptr] - 1) & 0xff
            if not isinstance(val, int):
                val = z3.simplify(val)
            self.mem[self.ptr] = val
            self.pc += 1
            next_states.append(self)
        elif op == 4:
            val = self.mem[self.ptr]
            print(f"[{self.id}] write {val}")
            not_fail = val != ord('Y')
            if not isinstance(not_fail, bool):
                not_fail = z3.simplify(not_fail)
            if not is_sat(not_fail):
                # You are not worthy :(
                pass
            else:
                self.print_flag()
                self.pc += 1
                next_states.append(self)
        elif op == 5:
            print(f"[{self.id}] read [{self.flag_len}]")
            if self.flag_len < len(FLAG):
                flag_byte = FLAG[self.flag_len]
                print(f"[{self.id}] read = {flag_byte}")
                self.mem[self.ptr] = flag_byte
                self.flag_len += 1
                self.pc += 1
                next_states.append(self)
            else:
                raise Exception("WTF")
                # pass
        elif op == 6:
            self.do_cond(next_states)
        elif op == 7:
            if len(self.brackets) > 0:
                self.pc = self.brackets.pop()
                next_states.append(self)
            else:
                raise Exception("WTF")
                # pass
        return next_states

    def get_op(self):
        if self.pc >= len(self.code):
            return None
        return self.mem[VTABLE + CHRS.index(self.code[self.pc])]

    def do_nz(self, condition, next_states):
        self.condition = condition
        self.brackets.append(self.pc)
        self.pc += 1
        next_states.append(self)

    def do_z(self, condition, next_states):
        self.condition = condition
        open_brackets = 1
        while open_brackets:
            self.pc += 1
            op = self.get_op()
            if op is None:
                raise Exception("WTF")
                # pass
            elif op == 6:
                open_brackets += 1
            elif op == 7:
                open_brackets -= 1
        self.pc += 1
        next_states.append(self)

    def do_cond(self, next_states):
        nz_condition = z3.simplify(z3.And(self.condition, self.mem[self.ptr] != 0))
        if is_true(nz_condition):
            self.do_nz(nz_condition, next_states)
            return

        z_condition = z3.simplify(z3.And(self.condition, self.mem[self.ptr] == 0))
        if is_false(nz_condition):
            self.do_z(z_condition, next_states)
            return

        if not is_sat(z_condition):
            self.do_nz(nz_condition, next_states)
            return

        if not is_sat(nz_condition):
            self.do_z(z_condition, next_states)
            return

        self.do_nz(nz_condition, next_states)
        print(f'fork {z_condition}')
        copy(self).do_z(z_condition, next_states)

    def print_flag(self):
        solver = z3.Solver()
        solver.add(self.condition)
        if str(solver.check()) == "sat":
            flag_bytes = b''
            for flag_byte in FLAG:
                if isinstance(flag_byte, int):
                    flag_bytes += bytes((flag_byte,))
                    continue
                flag_byte_val = solver.model()[flag_byte]
                if flag_byte_val is None:
                    flag_bytes += b"?"
                else:
                    flag_bytes += bytes((int(str(flag_byte_val)),))
            print(flag_bytes)


def rune_me(code):
    for c in code:
        assert c in CHRS
    states = [State(code)]
    prev_n_states = len(states)
    while len(states) > 0:
        next_states = []
        for state in states:
            next_states.extend(state.step())
        states = next_states
        if len(states) != prev_n_states:
            print(f"{len(states)} states")
            prev_n_states = len(states)


if __name__ == "__main__":
    r = ""
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚷᚠᚦᚠᚦᚦᚠᚦᚦᚦᚦᚦᚠᚦᚦᚦᚦᚦᚦᚠᚦᚦᚦᚦᚦᚦᚦᚢᚢᚢᚢᚢᚩᚹᚠᚠᚠᚦᚦᚦᚦᚦᚦᚱᚠᚦᚱᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚱᚩᚱᚦᚦᚦᚦᚱᚩᚩᚱᚱᚩᚩᚩᚩᚩᚩᚩᚩᚱᚦᚦᚦᚦᚦᚦᚦᚦᚦᚱᚢᚢᚱᚠᚠᚠᚦᚦᚦᚦᚱᚢᚩᚩᚩᚩᚩᚱᚦᚦᚦᚱᚱᚢᚢᚱᚠᚱᚠ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚱᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚱᚩᚩᚩᚩᚩᚩᚩᚱᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚱᚱᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚱᚢᚢᚦᚱᚢ"
    r += "ᚩᚩᚩᚩᚩᚩᚱᚠᚠᚠᚠᚷᚩᚹᚢᚷᚩᚹᚢᚷᚩᚹᚢᚷᚩᚹᚢᚷᚩᚹᚢᚢᚢᚢᚢᚢᚢᚩᚩᚩᚩᚠᚩᚩᚩᚩᚠᚩᚩᚩᚩᚠᚩᚩᚩᚩᚢᚢᚢᚢᚢᚢᚢᚦᚱᚩᚱ"
    r += "ᚦᚱᚦᚢᚩᚩᚩᚩᚩᚢᚩᚩᚩᚢᚩᚩᚩᚩᚩᚢᚩᚩᚩᚢᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚢᚩᚩᚢᚩᚩᚩᚩᚩᚢᚩᚩᚩᚩᚩᚩᚢᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚢᚩᚩᚩᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚳᚢᚢᚩᚩᚳᚦᚦᚦᚳᚩᚩᚩᚩᚩᚩᚩᚳᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚳᚦᚦᚦᚦᚦᚳᚩᚳᚠᚠᚳᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚳᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚳᚠᚠᚳᚢᚢᚢᚩᚳᚠᚩᚩᚩᚩᚳᚢᚦᚦᚦᚳᚠᚦᚳᚠᚠᚳᚢᚢᚢᚩᚩᚩᚩᚩᚳᚠᚩᚩᚩᚩᚩᚩᚩᚳᚢᚦᚦᚦᚦᚳᚦᚦᚦᚳᚠᚠᚠᚳᚢᚢᚢ"
    r += "ᚩᚳᚠᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚳᚦᚦᚳᚢᚦᚳᚠᚩᚩᚳᚢᚩᚩᚳᚠᚠᚠᚳᚢᚢᚢᚦᚦᚳᚩᚩᚩᚳᚦᚦᚦᚦᚦᚦᚦᚳᚩᚩᚠᚳᚢᚩᚩᚩᚳᚢᚦᚦᚦᚦᚦᚦᚳ"
    r += "ᚠᚠᚠᚠᚳᚢᚢᚢᚢᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚷᚠᚠᚠᚠᚠᚦᚦᚦᚦᚦᚢᚦᚦᚦᚢᚦᚦᚦᚦᚦᚢᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠ"
    r += "ᚷᚷᚷᚱᚷᚷᚷᚷᚷᚱᚷᚷᚷᚱᚷᚷᚷᚷᚷᚱᚱᚱᚱᚱᚱᚱᚢᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚷᚷᚷ"
    r += "ᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳ"
    r += "ᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱ"
    r += "ᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚷᚷᚷ"
    r += "ᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦᚳᚹᚱᚹᚩᚷ"
    r += "ᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹᚳᚦᚹᚩᚩᚱ"
    r += "ᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚢᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷ"
    r += "ᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳ"
    r += "ᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱ"
    r += "ᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚱᚷᚷ"
    r += "ᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦ"
    r += "ᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹ"
    r += "ᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚢᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷ"
    r += "ᚷᚷᚷᚷᚱᚹᚩᚳᚷᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱ"
    r += "ᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦ"
    r += "ᚳᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳ"
    r += "ᚩᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱ"
    r += "ᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳ"
    r += "ᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚢᚱᚱᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷ"
    r += "ᚷᚷᚷᚷᚷᚷᚷᚷᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱ"
    r += "ᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳ"
    r += "ᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩ"
    r += "ᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷ"
    r += "ᚱᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩ"
    r += "ᚳᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚹᚹᚱᚹᚹᚹᚹᚱᚹᚹᚹᚹᚱ"
    r += "ᚹᚹᚹᚹᚱᚷᚠᚩᚠᚦᚠᚩᚢᚢᚢᚢᚢᚢᚢᚹᚹᚹᚹᚹᚳᚹᚹᚹᚳᚹᚹᚹᚹᚹᚳᚹᚹᚹᚳᚳᚳᚳᚳᚳᚳᚠᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱ"
    r += "ᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳ"
    r += "ᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩ"
    r += "ᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳ"
    r += "ᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳ"
    r += "ᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱ"
    r += "ᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚳᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹ"
    r += "ᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱ"
    r += "ᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱ"
    r += "ᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳ"
    r += "ᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹ"
    r += "ᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳ"
    r += "ᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱ"
    r += "ᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩ"
    r += "ᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳ"
    r += "ᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩ"
    r += "ᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷ"
    r += "ᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦ"
    r += "ᚱᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱ"
    r += "ᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱ"
    r += "ᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳ"
    r += "ᚳᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹ"
    r += "ᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱ"
    r += "ᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚱᚷᚷᚷᚳᚳᚷᚷᚷ"
    r += "ᚷᚷᚷᚷᚳᚷᚷᚷᚷᚷᚱᚱᚱᚦᚦᚦᚦᚠᚠᚠᚠᚠᚦᚠᚠᚠᚠᚠᚠᚠᚦᚠᚦᚠᚠᚠᚦᚦᚦᚹᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠ"
    r += "ᚦᚢᚳᚩᚠᚦᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱ"
    r += "ᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚢᚱᚱᚦᚦᚦᚦᚦᚦᚱᚦᚦᚦᚳᚠᚠᚱᚢᚩᚩᚩᚳᚩᚩᚩᚢᚳᚦᚳᚦᚦᚦᚱᚩᚳᚦᚱᚱᚦᚱᚦᚢᚩᚢᚳᚦᚱᚩᚩᚩᚩ"
    r += "ᚩᚩᚠᚦᚦᚦᚦᚦᚦᚱᚢᚳᚳᚦᚳᚠᚱᚩᚱᚩᚩᚩᚠᚠᚦᚦᚦᚢᚳᚩᚩᚳᚦᚦᚳᚩᚩᚩᚱᚩᚩᚠᚦᚦᚢᚳᚦᚦᚦᚦᚱᚦᚦᚦᚳᚩᚩᚩᚱᚢᚩᚩᚩᚳᚩᚩᚩ"
    r += "ᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚩᚱᚢᚦᚢᚩᚳᚠᚦᚱᚩᚢᚦᚱᚢᚳᚳᚩᚱᚦᚠᚩᚱᚢᚳᚳᚠᚦᚱ"
    r += "ᚩᚢᚦᚢᚳᚠᚩᚱᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦᚢᚳᚠᚱᚩᚠᚦᚢᚳᚩᚩᚩᚩᚱᚢᚳᚦᚦᚦᚱᚩᚩᚩᚠᚦᚦᚦᚢᚳᚩᚢ"
    r += "ᚩᚱᚢᚳᚳᚦᚱᚢᚳᚱᚢᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚩᚠᚦᚦᚦᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚠᚦᚦᚳᚹᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦ"
    r += "ᚢᚳᚩᚠᚠᚠᚦᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦ"
    r += "ᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚢᚱᚱᚦᚦᚦᚦᚦᚦᚱᚦᚦᚦᚳᚠᚠᚱᚢᚩᚩᚩᚳᚩᚩᚩᚢᚳᚦᚳᚦᚦᚦᚱᚩᚳᚦᚱᚱᚦᚱᚦᚢᚩᚢᚳᚦᚱᚩᚩᚩ"
    r += "ᚩᚩᚩᚠᚦᚦᚦᚦᚦᚦᚱᚢᚳᚳᚦᚳᚠᚱᚩᚱᚩᚩᚩᚠᚠᚦᚦᚦᚢᚳᚩᚩᚳᚦᚦᚳᚩᚩᚩᚱᚩᚩᚠᚦᚦᚢᚳᚦᚦᚦᚦᚱᚦᚦᚦᚳᚩᚩᚩᚱᚢᚩᚩᚩᚳᚩᚩ"
    r += "ᚩᚦᚦᚦᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚩᚱᚢᚦᚢᚩᚳᚠᚦᚱᚩᚢᚦᚱᚢᚳᚳᚩ"
    r += "ᚱᚦᚠᚩᚱᚢᚳᚳᚠᚦᚱᚩᚢᚦᚢᚳᚠᚩᚱᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦᚢᚳᚠᚱᚩᚠᚦᚢᚳᚩᚩᚩᚩᚱᚢᚳᚦᚦᚦᚱ"
    r += "ᚩᚩᚩᚠᚦᚦᚦᚢᚳᚩᚢᚩᚱᚢᚳᚳᚦᚱᚢᚳᚱᚢᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚩᚠᚦᚦᚦᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚠᚦᚦᚳᚹᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩ"
    r += "ᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚦᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚱᚦᚦᚦᚦᚠᚦ"
    r += "ᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚢᚱᚱᚦᚦᚦᚦᚦᚦᚱᚦᚦᚦᚳᚠᚠᚱᚢᚩᚩᚩᚳᚩᚩᚩᚢᚳᚦᚳᚦᚦᚦᚱᚩᚳᚦᚱ"
    r += "ᚱᚦᚱᚦᚢᚩᚢᚳᚦᚱᚩᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚦᚱᚢᚳᚳᚦᚳᚠᚱᚩᚱᚩᚩᚩᚠᚠᚦᚦᚦᚢᚳᚩᚩᚳᚦᚦᚳᚩᚩᚩᚱᚩᚩᚠᚦᚦᚢᚳᚦᚦᚦᚦᚱᚦᚦ"
    r += "ᚦᚳᚩᚩᚩᚱᚢᚩᚩᚩᚳᚩᚩᚩᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚩᚱᚢᚦᚢᚩᚳᚠᚦᚱᚩᚢᚦ"
    r += "ᚱᚢᚳᚳᚩᚱᚦᚠᚩᚱᚢᚳᚳᚠᚦᚱᚩᚢᚦᚢᚳᚠᚩᚱᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦᚢᚳᚠᚱᚩᚠᚦᚢᚳᚩᚩᚩᚩᚱᚢ"
    r += "ᚳᚦᚦᚦᚱᚩᚩᚩᚠᚦᚦᚦᚢᚳᚩᚢᚩᚱᚢᚳᚳᚦᚱᚢᚳᚱᚢᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚩᚠᚦᚦᚦᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚠᚦᚦᚳᚹᚦᚦᚠᚠᚠᚠᚠᚠᚠᚱ"
    r += "ᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚱᚦ"
    r += "ᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚢᚱᚱᚦᚦᚦᚦᚦᚦᚱᚦᚦᚦᚳᚠᚠᚱᚢᚩᚩᚩᚳᚩᚩᚩᚢᚳᚦᚳᚦᚦᚦ"
    r += "ᚱᚩᚳᚦᚱᚱᚦᚱᚦᚢᚩᚢᚳᚦᚱᚩᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚦᚱᚢᚳᚳᚦᚳᚠᚱᚩᚱᚩᚩᚩᚠᚠᚦᚦᚦᚢᚳᚩᚩᚳᚦᚦᚳᚩᚩᚩᚱᚩᚩᚠᚦᚦᚢᚳᚦᚦ"
    r += "ᚦᚦᚱᚦᚦᚦᚳᚩᚩᚩᚱᚢᚩᚩᚩᚳᚩᚩᚩᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚠᚩᚱᚢᚦ"
    r += "ᚢᚩᚳᚠᚦᚱᚩᚢᚦᚱᚢᚳᚳᚩᚱᚦᚠᚩᚱᚢᚳᚳᚠᚦᚱᚩᚢᚦᚢᚳᚠᚩᚱᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦᚢᚳᚠᚱᚩᚠ"
    r += "ᚦᚢᚳᚩᚩᚩᚩᚱᚢᚳᚦᚦᚦᚱᚩᚩᚩᚠᚦᚦᚦᚢᚳᚩᚢᚩᚱᚢᚳᚳᚦᚱᚢᚳᚱᚢᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚩᚠᚦᚦᚦᚳᚩᚱᚢᚳᚩᚱᚢᚩᚩᚠᚦᚦᚳᚩᚩ"
    r += "ᚩᚢᚢᚢᚢᚢᚩᚢᚢᚢᚩᚢᚢᚢᚢᚢᚩᚢᚢᚢᚩᚠᚠᚠᚷᚠᚠᚠᚠᚠᚷᚠᚠᚠᚷᚳᚳᚳᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚦᚹᚹᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳ"
    r += "ᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚷᚢᚹᚹᚹᚹᚳᚹ"
    r += "ᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚱᚢᚢᚹᚹᚹᚹᚹᚹᚢᚹᚹᚹᚠᚳᚳᚢᚱᚷᚷᚷᚠᚷᚷᚷᚱᚠᚹᚠᚹᚹᚹᚢᚷᚠᚹᚢ"
    r += "ᚢᚹᚢᚹᚱᚷᚱᚠᚹᚢᚷᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚹᚢᚱᚠᚠᚹᚠᚳᚢᚷᚢᚷᚷᚷᚳᚳᚹᚹᚹᚱᚠᚷᚷᚠᚹᚹᚠᚷᚷᚷᚢᚷᚷᚳᚹᚹᚱᚠᚹᚹᚹᚹᚢᚹᚹ"
    r += "ᚹᚠᚷᚷᚷᚢᚱᚷᚷᚷᚠᚷᚷᚷᚹᚹᚹᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚷᚢᚱᚹᚱᚷᚠᚳᚹ"
    r += "ᚢᚷᚱᚹᚢᚱᚠᚠᚷᚢᚹᚳᚷᚢᚱᚠᚠᚳᚹᚢᚷᚱᚹᚱᚠᚳᚷᚢᚷᚢᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚢᚷᚷᚷᚷᚳᚹᚹᚹᚹᚱᚠᚳᚢᚷᚳᚹᚱᚠᚷᚷ"
    r += "ᚷᚷᚢᚱᚠᚹᚹᚹᚢᚷᚷᚷᚳᚹᚹᚹᚱᚠᚷᚱᚷᚢᚱᚠᚠᚹᚢᚱᚠᚢᚱᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚳᚹᚹᚠᚦᚹᚳᚳᚳᚳᚳ"
    r += "ᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷ"
    r += "ᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚱᚢᚢᚹᚹᚹᚹᚹᚹᚢᚹᚹᚹᚠᚳᚳᚢᚱᚷᚷᚷᚠᚷᚷᚷᚱᚠᚹᚠᚹᚹᚹᚢᚷᚠᚹᚢᚢᚹᚢᚹᚱᚷ"
    r += "ᚱᚠᚹᚢᚷᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚹᚢᚱᚠᚠᚹᚠᚳᚢᚷᚢᚷᚷᚷᚳᚳᚹᚹᚹᚱᚠᚷᚷᚠᚹᚹᚠᚷᚷᚷᚢᚷᚷᚳᚹᚹᚱᚠᚹᚹᚹᚹᚢᚹᚹᚹᚠᚷᚷᚷᚢ"
    r += "ᚱᚷᚷᚷᚠᚷᚷᚷᚹᚹᚹᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚷᚢᚱᚹᚱᚷᚠᚳᚹᚢᚷᚱᚹᚢᚱ"
    r += "ᚠᚠᚷᚢᚹᚳᚷᚢᚱᚠᚠᚳᚹᚢᚷᚱᚹᚱᚠᚳᚷᚢᚷᚢᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚢᚷᚷᚷᚷᚳᚹᚹᚹᚹᚱᚠᚳᚢᚷᚳᚹᚱᚠᚷᚷᚷᚷᚢᚱᚠᚹ"
    r += "ᚹᚹᚢᚷᚷᚷᚳᚹᚹᚹᚱᚠᚷᚱᚷᚢᚱᚠᚠᚹᚢᚱᚠᚢᚱᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚳᚹᚹᚠᚦᚹᚹᚹᚳᚳᚢᚷᚳᚳᚳᚳᚳ"
    r += "ᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚹᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷ"
    r += "ᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚱᚢᚢᚹᚹᚹᚹᚹᚹᚢᚹᚹᚹᚠᚳᚳᚢᚱᚷᚷᚷᚠᚷᚷᚷᚱᚠᚹᚠ"
    r += "ᚹᚹᚹᚢᚷᚠᚹᚢᚢᚹᚢᚹᚱᚷᚱᚠᚹᚢᚷᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚹᚢᚱᚠᚠᚹᚠᚳᚢᚷᚢᚷᚷᚷᚳᚳᚹᚹᚹᚱᚠᚷᚷᚠᚹᚹᚠᚷᚷᚷᚢᚷᚷᚳᚹᚹᚱ"
    r += "ᚠᚹᚹᚹᚹᚢᚹᚹᚹᚠᚷᚷᚷᚢᚱᚷᚷᚷᚠᚷᚷᚷᚹᚹᚹᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳ"
    r += "ᚳᚳᚷᚢᚱᚹᚱᚷᚠᚳᚹᚢᚷᚱᚹᚢᚱᚠᚠᚷᚢᚹᚳᚷᚢᚱᚠᚠᚳᚹᚢᚷᚱᚹᚱᚠᚳᚷᚢᚷᚢᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚢᚷᚷᚷᚷᚳᚹᚹᚹᚹ"
    r += "ᚱᚠᚳᚢᚷᚳᚹᚱᚠᚷᚷᚷᚷᚢᚱᚠᚹᚹᚹᚢᚷᚷᚷᚳᚹᚹᚹᚱᚠᚷᚱᚷᚢᚱᚠᚠᚹᚢᚱᚠᚢᚱᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷ"
    r += "ᚳᚹᚹᚠᚦᚹᚹᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚹᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷ"
    r += "ᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚷᚢᚹᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚹᚢᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚱᚠᚷᚷᚷᚱᚢᚢᚹᚹᚹᚹᚹᚹᚢᚹᚹᚹᚠ"
    r += "ᚳᚳᚢᚱᚷᚷᚷᚠᚷᚷᚷᚱᚠᚹᚠᚹᚹᚹᚢᚷᚠᚹᚢᚢᚹᚢᚹᚱᚷᚱᚠᚹᚢᚷᚷᚷᚷᚷᚷᚳᚹᚹᚹᚹᚹᚹᚢᚱᚠᚠᚹᚠᚳᚢᚷᚢᚷᚷᚷᚳᚳᚹᚹᚹᚱᚠᚷ"
    r += "ᚷᚠᚹᚹᚠᚷᚷᚷᚢᚷᚷᚳᚹᚹᚱᚠᚹᚹᚹᚹᚢᚹᚹᚹᚠᚷᚷᚷᚢᚱᚷᚷᚷᚠᚷᚷᚷᚹᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚷᚢᚱᚹᚱᚷᚠᚳᚹᚢᚷ"
    r += "ᚱᚹᚢᚱᚠᚠᚷᚢᚹᚳᚷᚢᚱᚠᚠᚳᚹᚢᚷᚱᚹᚱᚠᚳᚷᚢᚷᚢᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚱᚠᚹᚹᚹᚹᚢᚷᚷᚷᚷᚳᚹᚹᚹᚹᚱᚠᚳᚢᚷᚳᚹᚱᚠᚷᚷᚷᚷ"
    r += "ᚢᚱᚠᚹᚹᚹᚢᚷᚷᚷᚳᚹᚹᚹᚱᚠᚷᚱᚷᚢᚱᚠᚠᚹᚢᚱᚠᚢᚱᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚢᚱᚠᚷᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚷᚷᚷᚷᚷᚷᚷ"
    r += "ᚷᚱᚱᚱᚱᚱᚱᚱᚹᚱᚱᚱᚱᚱᚹᚱᚱᚱᚹᚱᚠᚩᚠᚦᚠᚩᚠᚦᚢᚢᚢᚢᚢᚢᚢᚦᚦᚦᚦᚦᚦᚷᚦᚦᚦᚦᚦᚦᚷᚦᚩᚩᚷᚱᚱᚹᚱᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷ"
    r += "ᚩᚷᚷᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚷᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷ"
    r += "ᚷᚳᚢᚹᚹᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚳᚠᚠᚷᚷᚷᚷᚷᚷᚠᚷᚷᚷᚢᚱᚱᚠᚳᚹᚹᚹᚢᚹ"
    r += "ᚹᚹᚳᚢᚷᚢᚷᚷᚷᚠᚹᚢᚷᚠᚠᚷᚠᚷᚳᚹᚳᚢᚷᚠᚹᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚷᚠᚳᚢᚢᚷᚢᚱᚠᚹᚠᚹᚹᚹᚱᚱᚷᚷᚷᚳᚢᚹᚹᚢᚷᚷᚢᚹᚹᚹᚠ"
    r += "ᚹᚹᚱᚷᚷᚳᚢᚷᚷᚷᚷᚠᚷᚷᚷᚢᚹᚹᚹᚠᚳᚹᚹᚹᚢᚹᚹᚹᚷᚷᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱ"
    r += "ᚱᚱᚱᚹᚠᚳᚷᚳᚹᚢᚱᚷᚠᚹᚳᚷᚠᚳᚢᚢᚹᚠᚷᚱᚹᚠᚳᚢᚢᚱᚷᚠᚹᚳᚷᚳᚢᚱᚹᚠᚹᚠᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚠᚹᚹᚹᚹᚱᚷᚷᚷ"
    r += "ᚷᚳᚢᚱᚠᚹᚱᚷᚳᚢᚹᚹᚹᚹᚠᚳᚢᚷᚷᚷᚠᚹᚹᚹᚱᚷᚷᚷᚳᚢᚹᚳᚹᚠᚳᚢᚢᚷᚠᚳᚢᚠᚳᚢᚹᚠᚳᚢᚹᚠᚳᚹᚹᚹᚱᚷᚷᚷᚢᚹᚠᚳᚢᚹᚠᚳᚹ"
    r += "ᚹᚱᚷᚷᚢᚩᚷᚷᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱᚱᚱᚷᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹ"
    r += "ᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚳᚠᚠᚷᚷᚷᚷᚷᚷᚠᚷᚷᚷᚢᚱᚱᚠ"
    r += "ᚳᚹᚹᚹᚢᚹᚹᚹᚳᚢᚷᚢᚷᚷᚷᚠᚹᚢᚷᚠᚠᚷᚠᚷᚳᚹᚳᚢᚷᚠᚹᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚷᚠᚳᚢᚢᚷᚢᚱᚠᚹᚠᚹᚹᚹᚱᚱᚷᚷᚷᚳᚢᚹᚹᚢᚷ"
    r += "ᚷᚢᚹᚹᚹᚠᚹᚹᚱᚷᚷᚳᚢᚷᚷᚷᚷᚠᚷᚷᚷᚢᚹᚹᚹᚠᚳᚹᚹᚹᚢᚹᚹᚹᚷᚷᚷᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱ"
    r += "ᚷᚳᚢᚹᚱᚱᚹᚠᚳᚷᚳᚹᚢᚱᚷᚠᚹᚳᚷᚠᚳᚢᚢᚹᚠᚷᚱᚹᚠᚳᚢᚢᚱᚷᚠᚹᚳᚷᚳᚢᚱᚹᚠᚹᚠᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚠᚹᚹᚹᚹᚱ"
    r += "ᚷᚷᚷᚷᚳᚢᚱᚠᚹᚱᚷᚳᚢᚹᚹᚹᚹᚠᚳᚢᚷᚷᚷᚠᚹᚹᚹᚱᚷᚷᚷᚳᚢᚹᚳᚹᚠᚳᚢᚢᚷᚠᚳᚢᚠᚳᚢᚹᚠᚳᚢᚹᚠᚳᚹᚹᚹᚱᚷᚷᚷᚢᚹᚠᚳᚢᚹ"
    r += "ᚠᚳᚹᚹᚱᚷᚷᚢᚩᚷᚷᚷᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱᚱᚱᚱᚷᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹ"
    r += "ᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚳᚠ"
    r += "ᚠᚷᚷᚷᚷᚷᚷᚠᚷᚷᚷᚢᚱᚱᚠᚳᚹᚹᚹᚢᚹᚹᚹᚳᚢᚷᚢᚷᚷᚷᚠᚹᚢᚷᚠᚠᚷᚠᚷᚳᚹᚳᚢᚷᚠᚹᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚷᚠᚳᚢᚢᚷᚢᚱᚠᚹ"
    r += "ᚠᚹᚹᚹᚱᚱᚷᚷᚷᚳᚢᚹᚹᚢᚷᚷᚢᚹᚹᚹᚠᚹᚹᚱᚷᚷᚳᚢᚷᚷᚷᚷᚠᚷᚷᚷᚢᚹᚹᚹᚠᚳᚹᚹᚹᚢᚹᚹᚹᚷᚷᚷᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷ"
    r += "ᚳᚢᚹᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚹᚠᚳᚷᚳᚹᚢᚱᚷᚠᚹᚳᚷᚠᚳᚢᚢᚹᚠᚷᚱᚹᚠᚳᚢᚢᚱᚷᚠᚹᚳᚷᚳᚢᚱᚹᚠᚹᚠᚷᚷᚷᚱᚷᚱᚹ"
    r += "ᚹᚹᚹᚳᚢᚷᚷᚷᚷᚠᚹᚹᚹᚹᚱᚷᚷᚷᚷᚳᚢᚱᚠᚹᚱᚷᚳᚢᚹᚹᚹᚹᚠᚳᚢᚷᚷᚷᚠᚹᚹᚹᚱᚷᚷᚷᚳᚢᚹᚳᚹᚠᚳᚢᚢᚷᚠᚳᚢᚠᚳᚢᚹᚠᚳᚢᚹ"
    r += "ᚠᚳᚹᚹᚹᚱᚷᚷᚷᚢᚹᚠᚳᚢᚹᚠᚳᚹᚹᚱᚷᚷᚢᚩᚷᚷᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚠᚹᚱᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱᚷᚹᚹᚠᚷᚷ"
    r += "ᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚳᚢᚹᚹᚹᚹᚠᚷᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚹᚳᚢᚷᚷᚷᚷᚷᚠᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷ"
    r += "ᚳᚢᚹᚹᚹᚳᚠᚠᚷᚷᚷᚷᚷᚷᚠᚷᚷᚷᚢᚱᚱᚠᚳᚹᚹᚹᚢᚹᚹᚹᚳᚢᚷᚢᚷᚷᚷᚠᚹᚢᚷᚠᚠᚷᚠᚷᚳᚹᚳᚢᚷᚠᚹᚹᚹᚹᚹᚹᚱᚷᚷᚷᚷᚷᚷᚠᚳ"
    r += "ᚢᚢᚷᚢᚱᚠᚹᚠᚹᚹᚹᚱᚱᚷᚷᚷᚳᚢᚹᚹᚢᚷᚷᚢᚹᚹᚹᚠᚹᚹᚱᚷᚷᚳᚢᚷᚷᚷᚷᚠᚷᚷᚷᚢᚹᚹᚹᚠᚳᚹᚹᚹᚢᚹᚹᚹᚷᚷᚱᚱᚱᚱᚠᚹᚱᚱᚱ"
    r += "ᚱᚱᚱᚱᚱᚱᚱᚷᚳᚢᚹᚱᚱᚱᚹᚠᚳᚷᚳᚹᚢᚱᚷᚠᚹᚳᚷᚠᚳᚢᚢᚹᚠᚷᚱᚹᚠᚳᚢᚢᚱᚷᚠᚹᚳᚷᚳᚢᚱᚹᚠᚹᚠᚷᚷᚷᚱᚷᚱᚹᚹᚹᚹᚳᚢᚷᚷ"
    r += "ᚷᚷᚠᚹᚹᚹᚹᚱᚷᚷᚷᚷᚳᚢᚱᚠᚹᚱᚷᚳᚢᚹᚹᚹᚹᚠᚳᚢᚷᚷᚷᚠᚹᚹᚹᚱᚷᚷᚷᚳᚢᚹᚳᚹᚠᚳᚢᚢᚷᚠᚳᚢᚠᚳᚢᚹᚠᚳᚢᚹᚠᚳᚹᚹᚹᚱᚷ"
    r += "ᚷᚷᚢᚹᚠᚳᚢᚹᚠᚳᚹᚹᚱᚷᚷᚢᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚳᚳᚳᚳᚷᚳᚳᚳᚳᚳᚳᚳᚷᚳᚷᚳᚳᚳᚢᚩᚩᚩᚢᚩᚢᚩᚩᚩᚩᚩᚩᚩᚢᚩᚩᚩᚩᚩᚢᚢ"
    r += "ᚢᚱᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚩᚩᚩᚩᚩᚢᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠ"
    r += "ᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚦᚹᚹᚢᚢᚢᚢᚢᚢᚹᚢᚢᚢᚷ"
    r += "ᚩᚩᚹᚦᚠᚠᚠᚷᚠᚠᚠᚦᚷᚢᚷᚢᚢᚢᚹᚠᚷᚢᚹᚹᚢᚹᚢᚦᚠᚦᚷᚢᚹᚠᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚢᚹᚦᚷᚷᚢᚷᚩᚹᚠᚹᚠᚠᚠᚩᚩᚢᚢᚢᚦᚷᚠ"
    r += "ᚠᚷᚢᚢᚷᚠᚠᚠᚹᚠᚠᚩᚢᚢᚦᚷᚢᚢᚢᚢᚹᚢᚢᚢᚷᚠᚠᚠᚹᚦᚠᚠᚠᚷᚠᚠᚠᚢᚢᚢᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚹᚠᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚩᚩᚩᚩᚠᚹᚦᚢᚦᚠᚷᚩᚢᚹᚠᚦᚢᚹᚦᚷᚷᚠᚹᚢᚩᚠᚹᚦᚷᚷᚩᚢᚹᚠᚦᚢᚦᚷᚩᚠᚹᚠᚹᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚦ"
    r += "ᚷᚢᚢᚢᚢᚹᚠᚠᚠᚠᚩᚢᚢᚢᚢᚦᚷᚩᚹᚠᚩᚢᚦᚷᚠᚠᚠᚠᚹᚦᚷᚢᚢᚢᚹᚠᚠᚠᚩᚢᚢᚢᚦᚷᚠᚦᚠᚹᚦᚷᚷᚢᚹᚦᚷᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠ"
    r += "ᚠᚩᚢᚢᚢᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚩᚢᚢᚷᚱᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚠᚠᚹᚢᚢᚢᚢᚩ"
    r += "ᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠ"
    r += "ᚠᚠᚦᚹᚹᚢᚢᚢᚢᚢᚢᚹᚢᚢᚢᚷᚩᚩᚹᚦᚠᚠᚠᚷᚠᚠᚠᚦᚷᚢᚷᚢᚢᚢᚹᚠᚷᚢᚹᚹᚢᚹᚢᚦᚠᚦᚷᚢᚹᚠᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚢᚹᚦᚷᚷᚢ"
    r += "ᚷᚩᚹᚠᚹᚠᚠᚠᚩᚩᚢᚢᚢᚦᚷᚠᚠᚷᚢᚢᚷᚠᚠᚠᚹᚠᚠᚩᚢᚢᚦᚷᚢᚢᚢᚢᚹᚢᚢᚢᚷᚠᚠᚠᚹᚦᚠᚠᚠᚷᚠᚠᚠᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚠᚹᚦᚢᚦᚠᚷᚩᚢᚹᚠᚦᚢᚹᚦᚷᚷᚠᚹᚢᚩᚠᚹᚦᚷᚷᚩᚢᚹᚠᚦᚢᚦᚷᚩᚠ"
    r += "ᚹᚠᚹᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚹᚠᚠᚠᚠᚩᚢᚢᚢᚢᚦᚷᚩᚹᚠᚩᚢᚦᚷᚠᚠᚠᚠᚹᚦᚷᚢᚢᚢᚹᚠᚠᚠᚩᚢᚢᚢᚦᚷᚠᚦᚠᚹᚦᚷᚷᚢᚹ"
    r += "ᚦᚷᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚠᚩᚢᚢᚢᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚩᚢᚢᚷᚱᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚢᚦᚷᚠᚩᚢᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹ"
    r += "ᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚦᚹᚹᚢᚢᚢᚢᚢᚢᚹᚢᚢᚢᚷᚩᚩᚹᚦᚠᚠᚠᚷᚠᚠᚠᚦᚷᚢᚷᚢᚢᚢᚹᚠᚷᚢᚹᚹᚢᚹᚢᚦᚠᚦᚷᚢᚹᚠᚠᚠᚠ"
    r += "ᚠᚠᚩᚢᚢᚢᚢᚢᚢᚹᚦᚷᚷᚢᚷᚩᚹᚠᚹᚠᚠᚠᚩᚩᚢᚢᚢᚦᚷᚠᚠᚷᚢᚢᚷᚠᚠᚠᚹᚠᚠᚩᚢᚢᚦᚷᚢᚢᚢᚢᚹᚢᚢᚢᚷᚠᚠᚠᚹᚦᚠᚠᚠᚷᚠᚠᚠ"
    r += "ᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢᚦᚷᚠᚩᚩᚩᚩᚩᚩᚩᚩᚠᚹᚦᚢᚦᚠᚷᚩᚢᚹᚠᚦᚢᚹᚦᚷᚷᚠᚹᚢᚩᚠᚹᚦᚷᚷᚩᚢᚹᚠ"
    r += "ᚦᚢᚦᚷᚩᚠᚹᚠᚹᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚹᚠᚠᚠᚠᚩᚢᚢᚢᚢᚦᚷᚩᚹᚠᚩᚢᚦᚷᚠᚠᚠᚠᚹᚦᚷᚢᚢᚢᚹᚠᚠᚠᚩᚢᚢᚢᚦᚷᚠᚦᚠ"
    r += "ᚹᚦᚷᚷᚢᚹᚦᚷᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚠᚩᚢᚢᚢᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚩᚢᚢᚷᚱᚢᚢᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚹᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚢ"
    r += "ᚦᚷᚠᚩᚩᚩᚩᚩᚢᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚠᚹᚢᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚠᚦᚷᚢᚢᚢ"
    r += "ᚢᚢᚹᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚦᚷᚠᚠᚠᚦᚹᚹᚢᚢᚢᚢᚢᚢᚹᚢᚢᚢᚷᚩᚩᚹᚦᚠᚠᚠᚷᚠᚠᚠᚦᚷᚢᚷᚢᚢᚢᚹᚠᚷᚢᚹᚹᚢᚹᚢᚦᚠᚦᚷᚢᚹᚠ"
    r += "ᚠᚠᚠᚠᚠᚩᚢᚢᚢᚢᚢᚢᚹᚦᚷᚷᚢᚷᚩᚹᚠᚹᚠᚠᚠᚩᚩᚢᚢᚢᚦᚷᚠᚠᚷᚢᚢᚷᚠᚠᚠᚹᚠᚠᚩᚢᚢᚦᚷᚢᚢᚢᚢᚹᚢᚢᚢᚷᚠᚠᚠᚹᚦᚠᚠᚠᚷ"
    r += "ᚠᚠᚠᚢᚩᚩᚩᚩᚩᚩᚩᚩᚠᚹᚦᚢᚦᚠᚷᚩᚢᚹᚠᚦᚢᚹᚦᚷᚷᚠᚹᚢᚩᚠᚹᚦᚷᚷᚩᚢᚹᚠᚦᚢᚦᚷᚩᚠᚹᚠᚹᚢᚢᚢᚩᚢᚩᚠᚠᚠᚠᚦᚷᚢᚢᚢᚢ"
    r += "ᚹᚠᚠᚠᚠᚩᚢᚢᚢᚢᚦᚷᚩᚹᚠᚩᚢᚦᚷᚠᚠᚠᚠᚹᚦᚷᚢᚢᚢᚹᚠᚠᚠᚩᚢᚢᚢᚦᚷᚠᚦᚠᚹᚦᚷᚷᚢᚹᚦᚷᚹᚦᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚠᚩᚢᚢᚢ"
    r += "ᚷᚠᚹᚦᚷᚠᚹᚦᚠᚠᚩᚢᚢᚷᚠᚠᚠᚠᚠᚠᚦᚦᚦᚦᚦᚢᚦᚦᚦᚢᚦᚦᚦᚦᚦᚢᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚷᚷᚷᚱᚷᚷᚷᚷᚷᚱᚷᚷᚷᚱᚷᚷᚷᚷᚷᚱᚱ"
    r += "ᚱᚱᚱᚱᚱᚢᚱᚱᚱᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱ"
    r += "ᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦ"
    r += "ᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱ"
    r += "ᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷ"
    r += "ᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱ"
    r += "ᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳ"
    r += "ᚳᚷᚱᚱᚩᚢᚱᚱᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱ"
    r += "ᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳ"
    r += "ᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳ"
    r += "ᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱ"
    r += "ᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳ"
    r += "ᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚢᚱᚱᚱᚷᚷᚦ"
    r += "ᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳ"
    r += "ᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱᚦᚱᚱᚱᚩᚷᚷᚦ"
    r += "ᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱᚱᚱᚹᚩᚳᚳᚩᚱ"
    r += "ᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚷᚷ"
    r += "ᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳᚳᚷᚱᚱᚱ"
    r += "ᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹᚩᚳᚦᚹᚳ"
    r += "ᚳᚷᚱᚱᚩᚢᚱᚱᚱᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚱᚹᚩᚳᚷᚷᚷᚷᚱᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱ"
    r += "ᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚳᚦᚱᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚱᚦᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚹᚩᚳᚳᚳᚹᚦᚦᚱᚱᚱᚱᚱᚱ"
    r += "ᚦᚱᚱᚱᚩᚷᚷᚦᚹᚳᚳᚳᚩᚳᚳᚳᚹᚩᚱᚩᚱᚱᚱᚦᚳᚩᚱᚦᚦᚱᚦᚱᚹᚳᚹᚩᚱᚦᚳᚳᚳᚳᚳᚳᚷᚱᚱᚱᚱᚱᚱᚦᚹᚩᚩᚱᚩᚷᚦᚳᚦᚳᚳᚳᚷᚷᚱ"
    r += "ᚱᚱᚹᚩᚳᚳᚩᚱᚱᚩᚳᚳᚳᚦᚳᚳᚷᚱᚱᚹᚩᚱᚱᚱᚱᚦᚱᚱᚱᚩᚳᚳᚳᚦᚹᚳᚳᚳᚩᚳᚳᚳᚱᚱᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷᚦᚳᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷ"
    r += "ᚱᚹᚩᚳᚷᚷᚷᚷᚳᚦᚹᚱᚹᚳᚩᚷᚱᚦᚳᚹᚱᚦᚹᚩᚩᚳᚦᚱᚷᚳᚦᚹᚩᚩᚷᚱᚦᚳᚹᚱᚹᚩᚷᚳᚦᚳᚦᚱᚱᚱᚷᚱᚷᚳᚳᚳᚳᚹᚩᚱᚱᚱᚱᚦᚳᚳᚳ"
    r += "ᚳᚷᚱᚱᚱᚱᚹᚩᚷᚦᚳᚷᚱᚹᚩᚳᚳᚳᚳᚦᚹᚩᚱᚱᚱᚦᚳᚳᚳᚷᚱᚱᚱᚹᚩᚳᚹᚳᚦᚹᚩᚩᚱᚦᚹᚩᚦᚹᚩᚳᚦᚹᚩᚳᚦᚹᚳᚳᚳᚷᚱᚱᚱᚩᚳᚦᚹ"
    r += "ᚩᚳᚦᚹᚳᚳᚷᚱᚱᚩᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚹᚹᚱᚹᚹᚹᚹᚱᚹᚹᚹᚹᚱᚹᚹᚹᚹᚱᚷᚠᚩᚠᚦᚠᚩᚢᚢᚢᚢᚢᚢᚢᚹᚹᚹᚹᚹᚳᚹᚹᚹᚳᚹᚹᚹ"
    r += "ᚹᚹᚳᚹᚹᚹᚳᚳᚳᚳᚳᚳᚳᚠᚳᚳᚳᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳ"
    r += "ᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦ"
    r += "ᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦ"
    r += "ᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩ"
    r += "ᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹ"
    r += "ᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩ"
    r += "ᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳ"
    r += "ᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳᚳᚩ"
    r += "ᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹᚳᚳ"
    r += "ᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹ"
    r += "ᚹᚹᚹᚳᚷᚦᚱᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱ"
    r += "ᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩ"
    r += "ᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳ"
    r += "ᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩᚩᚳᚳᚳᚳᚳ"
    r += "ᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱᚩᚱᚱᚱᚹᚹ"
    r += "ᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷ"
    r += "ᚦᚱᚹᚹᚹᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱ"
    r += "ᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷ"
    r += "ᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚠᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱ"
    r += "ᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚱᚩᚳᚳᚳᚳᚹᚳᚹᚱᚱᚱᚱᚱᚷᚦᚳᚳᚳᚳᚳᚩᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚷᚦᚱᚱᚱᚷᚩ"
    r += "ᚩᚳᚳᚳᚳᚳᚳᚩᚳᚳᚳᚦᚹᚹᚩᚷᚱᚱᚱᚦᚱᚱᚱᚷᚦᚳᚦᚳᚳᚳᚩᚱᚦᚳᚩᚩᚳᚩᚳᚷᚱᚷᚦᚳᚩᚱᚱᚱᚱᚱᚱᚹᚳᚳᚳᚳᚳᚳᚩᚷᚦᚦᚳᚦᚹᚩᚱ"
    r += "ᚩᚱᚱᚱᚹᚹᚳᚳᚳᚷᚦᚱᚱᚦᚳᚳᚦᚱᚱᚱᚩᚱᚱᚹᚳᚳᚷᚦᚳᚳᚳᚳᚩᚳᚳᚳᚦᚱᚱᚱᚩᚷᚱᚱᚱᚦᚱᚱᚱᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚩ"
    r += "ᚱᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚷᚦᚱᚹᚹᚹᚹᚱᚩᚷᚳᚷᚱᚦᚹᚳᚩᚱᚷᚳᚩᚷᚦᚦᚱᚩᚳᚹᚱᚩᚷᚦᚦᚹᚳᚩᚱᚷᚳᚷᚦᚹᚱᚩᚱᚩᚳᚳᚳᚹᚳᚹᚱᚱᚱ"
    r += "ᚱᚷᚦᚳᚳᚳᚳᚩᚱᚱᚱᚱᚹᚳᚳᚳᚳᚷᚦᚹᚩᚱᚹᚳᚷᚦᚱᚱᚱᚱᚩᚷᚦᚳᚳᚳᚩᚱᚱᚱᚹᚳᚳᚳᚷᚦᚱᚷᚱᚩᚷᚦᚦᚳᚩᚷᚦᚩᚷᚦᚱᚩᚷᚦᚱᚩᚷ"
    r += "ᚱᚱᚱᚹᚳᚳᚳᚦᚱᚩᚷᚦᚱᚩᚷᚱᚱᚹᚳᚳᚦᚱᚱᚱᚱᚱᚱᚱᚱᚱᚷᚱᚷᚷᚷᚳᚳᚷᚷᚷᚷᚷᚷᚷᚳᚷᚷᚷᚷᚷᚱᚱᚱᚦᚦᚦᚦᚠᚠᚠᚠᚠᚦᚠᚠᚠᚠ"
    r += "ᚠᚠᚠᚦᚠᚦᚠᚠᚠᚦᚦᚦᚱᚢᚳᚩᚱᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚷᚷᚱᚢᚳᚦᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠ"
    r += "ᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠ"
    r += "ᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚦᚦᚦᚠ"
    r += "ᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚦᚦᚦᚠᚠᚠᚱ"
    r += "ᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠ"
    r += "ᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢ"
    r += "ᚳᚩᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠ"
    r += "ᚠᚠᚦᚢᚳᚩᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠ"
    r += "ᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠ"
    r += "ᚠᚠᚠᚦᚢᚳᚩᚠᚦᚦᚦᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚦᚦᚦᚠᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚠᚠᚠᚠᚠᚠᚠᚠᚦᚦᚦ"
    r += "ᚠᚠᚠᚠᚱᚩᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚢᚳᚩᚦᚦᚠᚠᚠᚠᚠᚠᚠᚠᚠᚠᚦᚦᚦᚦᚦᚠᚱᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦ"
    r += "ᚢᚳᚩᚱᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚦᚦᚱᚱᚦᚦᚳᚠᚱᚩᚩᚳᚦᚦᚢᚳᚠᚱᚦᚦᚳᚩᚱᚩᚱᚩᚩᚳᚦᚠᚩᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚦᚦᚱᚦᚦᚳᚩᚢᚳᚩᚱᚩᚩᚳᚦᚱᚦᚱᚦᚦᚳᚩᚠᚩᚱᚩᚩᚳᚦᚢᚳᚦᚱᚦᚦᚳᚩᚩᚱᚢᚩᚩ"
    r += "ᚳᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚩᚱᚢᚦᚢᚩᚳᚠᚦᚱᚩᚢᚦᚱ"
    r += "ᚢᚳᚳᚩᚱᚦᚠᚩᚱᚢᚳᚳᚠᚦᚱᚩᚢᚦᚢᚳᚩᚱᚩᚩᚱᚦᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚩᚢᚳᚦᚦᚦᚦᚦᚱᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚢᚳᚩᚱᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚠᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚢᚳᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚦᚦᚱᚱᚦᚦᚳᚠᚱᚩᚩᚳᚦᚦᚢᚳᚠᚱᚦᚦᚳᚩᚱᚩᚱᚩᚩᚳᚦᚠᚩᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚠᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩ"
    r += "ᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚩᚦᚦᚱᚦᚦᚳᚩᚢᚳᚩᚱᚩᚩᚳᚦᚱᚦᚱᚦᚦᚳᚩᚠᚩᚱᚩᚩᚳᚦᚢᚳᚦᚱᚦᚦᚳᚩᚩᚱᚢᚩᚩᚳᚦᚦᚦᚦᚦ"
    r += "ᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚦᚷᚱᚢᚳᚩᚩᚩᚱᚦᚦᚦᚠᚦᚠᚩᚩᚩᚩᚢᚳ"
    r += "ᚦᚦᚦᚦᚱᚩᚩᚩᚩᚠᚦᚦᚦᚦᚢᚳᚠᚱᚩᚠᚦᚢᚳᚩᚩᚩᚩᚱᚢᚳᚦᚦᚦᚱᚩᚩᚩᚠᚦᚦᚦᚢᚳᚩᚱᚢᚳᚩᚠᚦᚳᚩᚢᚳᚩᚱᚢᚳᚦᚠᚱᚳᚳᚦᚩᚩᚩ"
    r += "ᚢᚢᚢᚢᚢᚩᚢᚢᚢᚩᚢᚢᚢᚢᚢᚩᚢᚢᚢᚩᚠᚠᚠᚷᚠᚠᚠᚠᚠᚷᚠᚠᚠᚷᚳᚳᚳᚳᚳᚹᚹᚹᚹᚹᚹᚹᚹᚹᚹᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚩᚩᚢᚱᚠᚷᚷᚢ"
    r += "ᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩ"
    r += "ᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷ"
    r += "ᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷ"
    r += "ᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳ"
    r += "ᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳ"
    r += "ᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳ"
    r += "ᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷ"
    r += "ᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠ"
    r += "ᚷᚹᚳᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳ"
    r += "ᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷ"
    r += "ᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳ"
    r += "ᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹ"
    r += "ᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷ"
    r += "ᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢ"
    r += "ᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷ"
    r += "ᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷ"
    r += "ᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹ"
    r += "ᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷ"
    r += "ᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠ"
    r += "ᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷ"
    r += "ᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷ"
    r += "ᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷ"
    r += "ᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠ"
    r += "ᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷ"
    r += "ᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷ"
    r += "ᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱ"
    r += "ᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹ"
    r += "ᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹ"
    r += "ᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳ"
    r += "ᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳ"
    r += "ᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹ"
    r += "ᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢ"
    r += "ᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩ"
    r += "ᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹ"
    r += "ᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹ"
    r += "ᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹ"
    r += "ᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚹᚹ"
    r += "ᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳ"
    r += "ᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷ"
    r += "ᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚹᚹᚢᚱᚷᚷᚳ"
    r += "ᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩ"
    r += "ᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱᚠᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚹ"
    r += "ᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚢᚱᚹᚹᚹᚳᚹᚳᚷᚷᚷᚷᚠᚹᚹᚹᚢᚱᚷᚷᚷᚳᚹᚹᚹᚠᚷᚹᚳᚳᚳᚳᚳᚳᚳᚳᚳᚢᚷᚳᚳᚳᚳᚳᚳᚳᚳᚳᚳᚹᚱ"
    r += "ᚠᚷᚹᚹᚢᚱᚷᚷᚳᚹᚹᚠᚷᚷᚩᚢᚱᚠᚷᚷᚷᚷᚷᚷᚷᚷᚷᚷ"
    rune_me(r)
